project-chip/connectedhomeip/examples/persistent-storage/efr32/main.cpp
/*
 * SPDX-FileCopyrightText: (c) 2021 Project CHIP Authors
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <bsp.h>
#include <stdio.h>
#include <stdlib.h>

#include <stdarg.h>
#include <stdbool.h>
#include <stdint.h>

#include <FreeRTOS.h>
#include <task.h>

#include "AppConfig.h"
#include "KeyValueStorageTest.h"
#include "init_efrPlatform.h"
#include "sl_system_kernel.h"
#include <platform/CHIPDeviceLayer.h>
#include <platform/EFR32/EFR32Config.h>
#include <platform/KeyValueStoreManager.h>

static TaskHandle_t sTestTaskHandle;
void TestTask(void * pvParameter)
{
    while (1)
    {
        EFR32_LOG("Running Tests:");
        chip::RunKvsTest();
        vTaskDelay(60000); // Run every minute
    }
}

int main(void)
{
    init_efrPlatform();

    chip::DeviceLayer::PersistedStorage::KeyValueStoreMgrImpl().Init();
    EFR32_LOG("==================================================");
    EFR32_LOG("chip-efr32-persitent-storage-example starting");
    EFR32_LOG("==================================================");

    // Run tests
    xTaskCreate(TestTask, "Test", 2048, NULL, 1, &sTestTaskHandle);
    EFR32_LOG("Starting FreeRTOS scheduler");
    sl_system_kernel_start();

    // Should never get here.
    EFR32_LOG("vTaskStartScheduler() failed");
    return -1;
}
